Diplom1C/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ЗадолженностиКлиентов</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкочнанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ПотраченоЧасовФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom1C/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ВКМ_ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ВКМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЗначенияЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения); 	
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Ссылка = Документы.ВКМ_ОбслуживаниеКлиента.ПустаяСсылка() Тогда
		
		ТекстСобщения = СтрШаблон("Поступила новая заявка от %2%3Специалист: %4%3Описание проблемы: %5%3Дата выполнения: %6 с %7 по %8", 
													ТекущийОбъект.Номер,
													Формат(ТекущийОбъект.Дата, "ДЛФ=DD"),
													Символы.ПС, 
		                                            ТекущийОбъект.ВКМ_Специалист,
													ТекущийОбъект.ВКМ_ОписаниеПроблемы, 
													Формат(ТекущийОбъект.ВКМ_ДатаПроведенияРабот,  "ДЛФ=DD"),
													Формат(ТекущийОбъект.ВКМ_ВремяНачалаРаботПлан, "ДФ=ЧЧ:мм:сс"),
													Формат(ТекущийОбъект.ВКМ_ВремяОкочнанияРаботПлан, "ДФ=ЧЧ:мм:сс")); 
													
		Справочники.ВКМ_Уведомления.ВКМ_СоздатьУведомлениеСотрудникам(ТекстСобщения);
		
		Возврат;
	КонецЕсли;
	
	Если ТекущийОбъект.ВКМ_Специалист <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Ссылка, "ВКМ_Специалист") Тогда
		
		ТекстСобщения = СтрШаблон("У заявки №%1 от %2 ИЗМЕНИЛСЯ СПЕЦИАЛИСТ!
								 |%3Актуальные данные записи:%3Специалист: %4%3Описание проблемы: %5%3Дата выполнения: %6 с %7 по %8", 
																			ТекущийОбъект.Номер,
																			Формат(ТекущийОбъект.Дата, "ДЛФ=DD"),
																			Символы.ПС, 
																			ТекущийОбъект.ВКМ_Специалист,
																			ТекущийОбъект.ВКМ_ОписаниеПроблемы, 
																			Формат(ТекущийОбъект.ВКМ_ДатаПроведенияРабот,  "ДЛФ=DD"),
																			Формат(ТекущийОбъект.ВКМ_ВремяНачалаРаботПлан, "ДФ=ЧЧ:мм:сс"),
																			Формат(ТекущийОбъект.ВКМ_ВремяОкочнанияРаботПлан, "ДФ=ЧЧ:мм:сс")); 
		
		Справочники.ВКМ_Уведомления.ВКМ_СоздатьУведомлениеСотрудникам(ТекстСобщения);
		
		
	КонецЕсли;
	
	ДанныеЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект.Ссылка, "ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРаботПлан, ВКМ_ВремяОкочнанияРаботПлан");
	
	Если ТекущийОбъект.ВКМ_ДатаПроведенияРабот <> ДанныеЗаписи.ВКМ_ДатаПроведенияРабот
		ИЛИ ТекущийОбъект.ВКМ_ВремяНачалаРаботПлан <> ДанныеЗаписи.ВКМ_ВремяНачалаРаботПлан 
		ИЛИ ТекущийОбъект.ВКМ_ВремяОкочнанияРаботПлан <> ДанныеЗаписи.ВКМ_ВремяОкочнанияРаботПлан Тогда
		
		ТекстСобщения = СтрШаблон("У заявки №%1 от %2 ИЗМЕНИЛАСЬ ДАТА ПРОВЕДЕНИЯ РАБОТ!
								 |%3Актуальные данные записи:%3Специалист: %4%3Описание проблемы: %5%3Дата выполнения: %6 с %7 по %8", 
																			ТекущийОбъект.Номер,
																			Формат(ТекущийОбъект.Дата, "ДЛФ=DD"),
																			Символы.ПС, 
																			ТекущийОбъект.ВКМ_Специалист,
																			ТекущийОбъект.ВКМ_ОписаниеПроблемы, 
																			Формат(ТекущийОбъект.ВКМ_ДатаПроведенияРабот,  "ДЛФ=DD"),
																			Формат(ТекущийОбъект.ВКМ_ВремяНачалаРаботПлан, "ДФ=ЧЧ:мм:сс"),
																			Формат(ТекущийОбъект.ВКМ_ВремяОкочнанияРаботПлан, "ДФ=ЧЧ:мм:сс")); 
		
		Справочники.ВКМ_Уведомления.ВКМ_СоздатьУведомлениеСотрудникам(ТекстСобщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	
	Оповестить("Изменение_ОбслуживаниеКлиента"); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
